&НаСервере 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//отменяем стандартную обработку процедуры построения отчета 
СтандартнаяОбработка = Ложь; 
//получить общий макет Нормативы в переменную; 
//сформировать новый объект типа Табличный документ; 
//сформировать табличный документ на основе общего макета; 
//получить номер последней строки и колонки ТабДок, 
//на их основе получить область ячеек, включая строку 
//заголовков колонок  
Макет = ПолучитьОбщийМакет("Нормативы"); 
ТабДок = Новый ТабличныйДокумент;
ТабДок = Макет.ПолучитьОбласть();   
ПоследняяСтрока = ТабДок.ВысотаТаблицы;
ПоследняяКолонка = ТабДок.ШиринаТаблицы;
ОбластьЯчеек = ТабДок.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
//создать описание источника данных 
ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек); 
//создать объект ПостроительОтчета, 
//указать источник данных вместо текста запроса 
//и выполнить построение отчета 
ПостроительОтчета = Новый ПостроительОтчета; 
ПостроительОтчета.ИсточникДанных = ИсточникДанных;
ПостроительОтчета.Выполнить(); 
//результат выгрузить в таблицу значений; 
//минусом этого способа является то, что получим значения 
//колонок в строковом формате 
ТабЗначений = Новый ТаблицаЗначений; 
ТабЗначений = ПостроительОтчета.Результат.Выгрузить(); 

Колонка=ТабЗначений.ВыгрузитьКолонку("ВерхняяГраница");
ТабЗначений.Колонки.Удалить("ВерхняяГраница");
ОписаниеТипов=Новый ОписаниеТипов("Число");
ТабЗначений.Колонки.Добавить("ВерхняяГраница",ОписаниеТипов);

i=0;
Для Каждого Элемент из ТабЗначений Цикл
	Элемент.ВерхняяГраница = ТиповыеФункции.СтрокуВЧисло(Колонка[i]);
	i=i+1;
КонецЦикла;

Колонка=ТабЗначений.ВыгрузитьКолонку("НижняяГраница");
ТабЗначений.Колонки.Удалить("НижняяГраница");
ОписаниеТипов=Новый ОписаниеТипов("Число");
ТабЗначений.Колонки.Добавить("НижняяГраница",ОписаниеТипов);

i=0;
Для Каждого Элемент из ТабЗначений Цикл
	Элемент.НижняяГраница = ТиповыеФункции.СтрокуВЧисло(Колонка[i]);
	i=i+1;
КонецЦикла;

//Набор данных Объект из отчета заполняем данными, 
//выгруженными из общего макета в таблицу значений 
НаборыДанных = Новый Структура("Нормативы", ТабЗначений); 
//Начинаем программно формировать отчет с помощью объектов 
//системы компоновки данных 
Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
Макет = КомпоновщикМакета.Выполнить 
(Схема, КомпоновщикНастроек.Настройки); 
ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//ПроцессорКомпоновки.ВозможностьИспользованияВнешнихФункций(Истина);
//Параметр Истина, чтобы можно было использовать внешние 
//функции при заполнении полей компоновки 
ПроцессорКомпоновки.Инициализировать 
(Макет, НаборыДанных, , Истина); 
ПроцессорВывода = Новый 
ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

КонецПроцедуры
